Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And all who are on the earth will give him worship, everyone whose name has not been from the first in the book of life of the Lamb who was put to death.
chr: ᎠᎴ ᎾᏂᎥ ᎡᎶᎯ ᏓᏁᏩᏗᏒ ᏓᎬᏩᏓᏙᎵᏍᏓᏁᎵ, ᎾᏍᎩ ᏚᎾᏙᎥ ᏂᏗᎪᏪᎸᎾ ᎬᏂᏛ ᎪᏪᎵᎯ ᎾᏍᎩ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᏤᎵᎦ, ᎾᏍᎩ [ᎤᏃᏕᎾ ᎠᎩᎾ] ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ ᎠᏥᎸᎯ ᏥᎨᏎᎢ.

source: If any man sends others into prison, into prison he will go: if any man puts to death with the sword, with the sword will he be put to death. Here is the quiet strength and the faith of the saints.
chr: ᎩᎶ ᎠᏂᏴᎩ ᏓᏘᎾᏫᏗᏍᎨᏍᏗ ᎾᏍᎩ ᎠᏴᎩ ᎠᎦᏘᏁᏫᏛᏗ ᎨᏎᏍᏗ; ᎩᎶ ᎭᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎠᏓᎯᏍᏗᏍᎨᏍᏗ ᎾᏍᎩ ᎠᏎ ᎭᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎬᏗ ᎠᏥᎢᏍᏗ ᎨᏎᏍᏗ. ᎠᏂ ᎾᏍᎩ ᏗᏅᏂᏗᏳ ᎨᏒ ᎠᎴ ᎤᏃᎯᏳᏒ ᎤᎾᏓᏅᏘ [ᎬᏂᎨᏒ ᏂᎦᎵᏍᏗᎭ.]

source: And I saw another beast coming up out of the earth; and he had two horns like a lamb, and his voice was like that of a dragon.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎥᏥᎪᎥᎩ ᎦᏙᎯ ᏓᏳᏄᎪᏥᏗᏒᎩ; ᎠᎴ ᏔᎵ ᏚᎷᎬᎩ ᎤᏃᏕᎾ ᎠᎩᎾ ᏥᏚᎷᎪ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎢᎾᏛ ᎦᏬᏂᏍᎬ ᎾᏍᎩᏯ ᎦᏬᏂᏍᎬᎩ.

source: And he makes use of all the authority of the first beast before his eyes. And he makes the earth and those who are in it give worship to the first beast, whose death-wound was made well.
chr: ᎠᎴ ᎢᎬᏱ ᎤᎾᏄᎪᏨᎯ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎾᏍᎩᏯ ᏄᎵᏂᎬᎬ ᏄᎵᏂᎬᎬᎩ, ᎠᎴ ᎡᎶᎯ ᎠᎴ ᎾᏍᎩ ᎾᎿ ᎠᏁᎯ ᎤᎾᏓᏙᎵᏍᏓᏁᏗᏱ ᏂᏕᎬᏁᎲᎩ ᎢᎬᏱ ᎤᎾᏄᎪᏨᎯ ᏅᎩ-ᏗᎦᏅᏌᏗ, ᎾᏍᎩ ᎬᏩᏲᎱᎯᏍᏗ ᎨᏒ ᎢᏴᏛ ᎠᏥᏐᏅᏅ ᎤᏗᏩᏒᎯ.

source: And he does great signs, even making fire come down from heaven on the earth before the eyes of men.
chr: ᎠᎴ ᎤᏣᏘ ᎤᏍᏆᏂᎪᏗ ᏕᎤᎸᏫᏍᏓᏁᎭ, ᎾᏍᎩ ᎠᏥᎸ ᎦᎸᎳᏗ ᏅᏓᏳᎶᎯᏍᏗᏱ ᎠᏂᏃ ᎡᎶᎯ ᎤᏬᏥᎯᏍᏗᏱ ᏂᎬᏁᎭ ᏴᏫ ᎠᏥᎦᏔᎲᎢ,

source: And those who are on the earth are turned from the true way by him through the signs which he was given power to do before the beast; giving orders to those who are on the earth to make an image to the beast, who was wounded by the sword, and came to life.
chr: ᎠᎴ ᎡᎶᎯ ᎠᏁᎯ ᏕᎦᎶᏄᎮᎭ ᎬᏗᏍᎬ ᎤᏍᏆᏂᎪᏗ ᏗᎬᏩᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎠᎦᏔᎲ ᏅᎩ-ᏗᎦᏅᏌᏗ; ᎯᎠ ᏂᏕᎦᏪᏎᎭ ᎾᏍᎩ Ꮎ ᎡᎶᎯ ᎠᏁᎯ, ᎾᏍᎩ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏗᏟᎶᏍᏔᏅᎯ ᎢᏦᏢᎾ, ᎾᏍᎩ ᎭᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎬᏗ ᎠᏥᏐᏅᏅᎯ ᎠᎴ ᏧᏛᏂᏛᎩ.

source: And he had power to give breath to the image of the beast, so that words might come from the image of the beast, and that he might have all those who did not give worship to the image of the beast put to death.
chr: ᎠᎴ ᎤᎲᎩ ᎬᏃᏛ ᎢᏳᏩᏁᏗᏱ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎾᏍᎩ ᎬᏩᏬᏂᎯᏍᏗ ᎢᏳᎵᏍᏙᏗᏱ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏩᏂᏐᏗᏱ ᏗᎨᏥᎢᏍᏗᏱ ᎾᏂᎥ ᎾᎾᏓᏙᎵᏍᏓᏁᎲᎾ ᎾᏍᎩ Ꮎ ᏅᎩᏗᎦᏅᏌᏗ ᏣᎦᏟᎶᏍᏔᏅᎯ.

source: And he gives to all, small and great, the poor and those who have wealth, the free and those who are not free, a mark on their right hand or on their brows;
chr: ᎠᎴ ᎾᏍᎩ ᏄᏩᏂᏌᏅᎩ ᏂᎦᏗᏳ ᏧᎾᏍᏗᏱ ᎠᎴ ᏧᎾᏛᎾ, ᏧᏁᎿᎢ ᎠᎴ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ, ᏂᏗᎨᏥᎾᏝᎥᎾ ᎠᎴ ᏗᎨᏥᎾᏝᎢ, ᏗᎨᎪᏪᎶᏗᏱ ᏗᏂᎦᏘᏏᏗᏢ ᏧᏃᏰᏂ, ᎠᎴ ᏗᏂᎬᏓᎨᏂ;

source: So that no man might be able to do trade but he who has the mark, even the name of the beast or the number of his name.
chr: ᎠᎴ ᎾᏍᎩ ᎩᎶ ᎬᏩᏩᎯᏍᏗ ᏂᎨᏒᎾ ᎠᎴ ᎬᏩᎾᏗᏅᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ Ꮎ ᎤᏩᏒ ᎠᎪᏪᎵ, ᎠᎴ ᏚᏙᎥᏉ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎠᎪᏪᎶᏔᏅᎯ, ᎠᎴ ᏚᏙᎥ ᎢᎦᎢ ᎠᏎᏍᏗᏱ ᎨᏒ ᎠᎪᏪᎶᏔᏅᎯ.

source: Here is wisdom. He who has knowledge let him get the number of the beast; because it is the number of a man: and his number is Six hundred and sixty-six.
chr: ᎠᏂ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎪᎱᏍᏗ ᎢᏛᏓ. ᎩᎶ ᎤᏬᎵᏣᏘ ᎨᏎᏍᏗ ᏩᏎᎦ ᎢᎦᎢ ᎨᏒ ᎠᎦᏎᏍᏗᏱ ᏅᎩ-ᏗᎦᏅᏎᏗ; ᏴᏫᏰᏃ ᎤᏎᏍᏗ ᎨᏒ ᎤᎬᏩᎳ; ᎠᎴ ᎾᏍᎩ ᎠᎦᏎᏍᏗ ᎨᏒ ᎯᎠ ᏂᎦᎥ, ᏑᏓᎵᏧᏈ ᏑᏓᎳᏍᎪᎯ ᏑᏓᎵᎦᎵ.

source: And I saw the Lamb on the mountain of Zion, and with him a hundred and forty-four thousand, marked on their brows with his name and the name of his Father.
chr: ᏫᏓᏆᎧᎾᏅᎩᏃ, ᎠᎴ ᎬᏂᏳᏉ ᎤᏃᏕᎾ ᎠᎩᎾ ᏌᏯᏂ ᎣᏓᎸ ᎦᏙᎬᎩ, ᎠᎴ ᎤᎾᎵᎪᏒᎩ ᎠᏍᎪᎯᏧᏈ ᏅᎦᏍᎪᎯ ᏅᎩᎦᎵ ᎢᏯᎦᎵ ᎢᏯᏂᏛ, ᎾᏍᎩ ᎤᏙᏓ ᏚᏙᎥ ᏚᏃᏪᎸᎩ ᏗᏂᎬᏓᎨᏂ.

source: And a voice from heaven came to my ears, like the sound of great waters, and the sound of loud thunder: and the voice which came to me was like the sound of players, playing on instruments of music.
chr: ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎩᎶ ᎧᏁᎬ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ, ᎠᎹ ᎤᏣᏘ ᏥᏚᏍᏆᏃᏴᎪ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎾᏍᎩᏯ ᎠᏴᏓᏆᎶᏍᎩ ᎤᏣᏘ ᏧᏍᏆᏃᏴᎪᎢ; ᎠᎴ ᏗᏂᏃᎩᏍᎩ ᏗᎧᏃᎩᏍᏙᏗ ᏗᏂᏃᎩᏍᏗᏍᎬ ᎤᏃᏴᎬ ᎠᏆᏛᎦᏅᎩ.

source: And they made as it seemed a new song before the high seat, and before the four beasts and the rulers: and no man might have knowledge of the song but the hundred and forty-four thousand, even those from the earth whom God has made his for a price.
chr: ᎠᎴ ᎢᏤ ᏥᏓᏂᏃᎩᏍᎪ ᎾᏍᎩᏯ ᎨᏒᎩ ᎢᎬᏱᏗᏢ ᎦᏍᎩᎸᎢ, ᎠᎴ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᏄᎾᏛᏅ ᎢᎬᏱᏗᏢ, ᎠᎴ ᏧᎾᏛᏐᏅᎯ ᏄᎾᏛᏅᎢ; ᎥᏝ ᎠᎴ ᎩᎶ ᎬᏩᏕᎶᏆᏍᏗ ᏱᎨᏎ ᎾᏍᎩ Ꮎ ᏗᎧᏃᎩᏍᏗ Ꮎ ᎤᏅᏒ ᎠᏍᎪᎯᏧᏈ ᏅᎦᏍᎪᎯ ᏅᎩᎦᎵ ᎢᏯᎦᏴᎵ ᎢᏯᏂᏛ, ᎾᏍᎩ ᎡᎶᎯ ᎨᎪᏣᎴᏛ ᎨᎦᎫᏴᏛ ᎨᏒᎢ.

source: These are they who have not made themselves unclean with women; for they are virgins. These are they who go after the Lamb wherever he goes. These were taken from among men to be the first fruits to God and to the Lamb.
chr: ᎯᎠ ᎾᏍᎩ Ꮎ ᎠᏂᎨᏴ ᎦᏓᎭ ᎢᎬᏩᏅᏁᎸᎯ ᏂᎨᏒᎾ; ᎤᎾᏓᏅᎦᎸᏛᏰᏃ ᎨᏒᎩ ᎾᏍᎩ. ᎯᎠ ᎾᏍᎩ Ꮎ ᎤᏃᏕᎾ ᎠᎩᎾ ᏥᎬᏩᏍᏓᏩᏗᏙᎭ ᏂᎦᎥ ᎡᏙᎲᎢ. ᎯᎠ ᎾᏍᎩ ᏴᏫ ᎠᏁᎲ ᎨᎪᏣᎴᏛ ᎨᎦᎫᏴᏛ, ᎢᎬᏱ ᎬᏩᎾᏓᏓᏁᎸᎯ ᎢᏳᎾᎵᏍᏔᏅᎯ ᏥᎩ ᎤᏁᎳᏅᎯ ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ.

source: And in their mouth there was no false word, for they are untouched by evil.
chr: ᎠᎴ ᎾᏍᎩ ᏗᏂᎰᎵ ᎨᏒ ᎥᏝ ᎦᎶᏄᎮᏛ ᎬᏩᏛᏗ ᏱᎨᏎᎢ; ᎾᏂᏍᎦᏅᎾᏰᏃ ᎤᏁᎳᏅᎯ ᎤᏪᏍᎩᎸ ᎢᎬᏱᏗᏢ ᏄᎾᏛᏅᎢ.

source: And I saw another angel in flight between heaven and earth, having eternal good news to give to those who are on the earth, and to every nation and tribe and language and people,
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎥᏥᎪᎥᎩ ᎦᎸᎶᎢ ᎠᏰᎵ ᎨᏒ ᎦᏃᎯᎵᏒᎩ, ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᏁᎲᎩ ᏧᎵᏥᏙᏁᏗ ᎾᏍᎩ Ꮎ Ꮎ ᎡᎶᎯ ᎠᏁᎯ, ᎠᎴ ᏂᎦᏗᏳ ᎤᎾᏓᏤᎵᏛ ᏓᏁᏩᏗᏒ ᏴᏫ, ᎠᎴ ᏗᏂᎳᏍᏓᎳᏩᏗᏒᎢ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ, ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᏴᏫ,

source: Saying with a loud voice, Have fear of God and give him glory; because the hour of his judging is come; and give worship to him who made heaven and earth and the sea and the fountains of water.
chr: ᎯᎠ ᏂᎦᏪᏍᎬᎩ ᎠᏍᏓᏯ ᎧᏁᎬᎩ, ᎤᏁᎳᏅᎯ ᎡᏥᎾᏰᏍᎨᏍᏗ, ᎠᎴ ᎾᏍᎩ ᎡᏥᎸᏉᏗᏍᎨᏍᏗ; ᎾᎯᏳᏰᏃ ᏧᏭᎪᏙᏗ ᎨᏒ ᎠᎵᏰᎢᎶᎦ; ᎠᎴ ᎡᏣᏓᏙᎵᏍᏓᏏ ᎾᏍᎩ Ꮎ ᎦᎸᎶᎢ ᎤᏬᏢᏅᎯ, ᎠᎴ ᎡᎶᎯ, ᎠᎴ ᎠᎺᏉᎯ, ᎠᎴ ᎠᎹ ᏕᎦᏄᎪᎬᎢ.

source: And a second angel came after, saying, Destruction has come to Babylon the great, which gave to all the nations the wine of the wrath of her evil ways.
chr: ᏅᏩᏓᎴᏃ ᏗᎧᎿᏩᏗᏙᎯ ᎠᎵᏍᏓᏩᏗᏒᎩ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᏓᏓᎶᏂ ᎠᏲᎩ, ᎠᏲᎩ, ᎾᏍᎩ Ꮎ ᎡᏆ ᏥᎦᏚᎲᎩ, ᏅᏓᎦᎵᏍᏙᏓ ᏂᎦᏗᏳ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒ ᎤᎾᏗᏔᏍᏗᏱ ᏂᏚᏩᏁᎸ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏓᏑᏱ ᎤᏕᎵᏛ ᏚᏂᏏᏂᏙᎸ ᎢᏳᏩᏂᏌᏛ.

source: And a third angel came after them, saying with a loud voice, If any man gives worship to the beast and his image, and has his mark on his brow or on his hand,
chr: ᏦᎢᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏂᏍᏓᏩᏛᏒᎩ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ ᎠᏍᏓᏯ ᎧᏁᎬᎩ, ᎢᏳᏃ ᎩᎶ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎠᏓᏙᎵᏍᏓᏁᎮᏍᏗ, ᎠᎴ ᎾᏍᎩ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎠᎴ ᎠᎬᏓᎨᏂ ᎠᎴ ᎤᏬᏰᏂᏉ ᎠᎪᏪᎵᏍᎨᏍᏗ,

source: To him will be given of the wine of God's wrath which is ready unmixed in the cup of his wrath and he will have cruel pain, burning with fire before the holy angels and before the Lamb:
chr: ᎾᏍᎩ ᎤᏗᏔᏍᏗ ᎨᏎᏍᏗ ᎨᎦᎨᎠᏗᏔᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏓᏑᏱ, ᎾᏍᎩ ᎠᎹ ᎾᏑᏴᎾ ᎦᏐᏅᏴᎯ ᏥᎩ, ᎾᏍᎩ ᎤᎿᎸᏒ ᎠᏩᏘᏍᎩ ᎤᎵᏍᏈᏗᎯ ᎠᏢᎯ ᏥᎩ; ᎠᎴ ᎾᏍᎩ ᎠᏥᎸ ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ ᎠᏥᎩᎵᏲᎢᏍᏙᏗ ᎨᏎᏍᏗ ᎨᏥᎸᏉᏗ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎠᏂᎦᏔᎲᎢ, ᎠᎴ ᎤᏃᏕᎾ-ᎠᎩᎾ ᎠᎦᏔᎲᎢ;

source: And the smoke of their pain goes up for ever and ever; and they have no rest day and night, who give worship to the beast and his image, and have on them the mark of his name.
chr: ᎠᎴ ᎾᏍᎩ ᎠᏂᎩᎵᏲᎬ ᏚᎦᏒᏍᏛ ᏓᎴᎲᏍᎦ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸᎢ; ᎠᎴ ᎥᏝ ᎬᏩᎾᏣᏪᏐᎸᏍᏙᏗ ᏱᎩ, ᎢᎦ ᎠᎴ ᏒᏃᏱ, ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎠᎾᏓᏙᎵᏍᏓᏁᎯ ᎠᎴ ᎾᏍᎩ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎠᎴ ᎾᏂᎥᏉ ᎩᎶ ᎾᏍᎩ ᏚᏙᎥ ᎨᎪᏪᎶᏔᏅᎯ.

source: Here is the quiet strength of the saints, who keep the orders of God, and the faith of Jesus.
chr: ᎠᏂ ᎬᏂᎨᏒ ᏂᎦᎵᏍᏗᎭ ᏗᏅᏂᏗᏳ ᎨᏒ ᎤᎾᏓᏅᏘ; ᎠᏁ ᎠᏁᎭ ᏗᏂᏍᏆᏂᎪᏗᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ, ᎠᎴ ᎪᎯᏳᏗ ᎨᏒ ᏥᏌ ᎤᏤᎵᎦ.

source: And a voice from heaven came to my ears, saying, Put in writing, There is a blessing on the dead who from now on come to their end in the Lord: yes, says the Spirit, that they may have rest from their troubles; for their works go with them.
chr: ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎩᎶ ᎧᏁᎬ ᎦᎸᎳᏗ ᏛᏓᎴᎲᏍᎬᎩ ᎯᎠ ᏅᏛᎩᏪᏎᎲᎩ, ᎰᏪᎸᎩ, [ᎯᎠ ᏅᎦ,] ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᏧᏂᏲᎱᏒᎯ ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᏚᎾᏁᎶᏛ ᏗᏂᏲᎱᏍᎩ ᎪᎯ ᎢᏳᏓᎴᏅᏛ; ᎤᏙᎯᏳᎯ ᎠᏗᎭ ᎠᏓᏅᏙ ᎾᏍᎩ ᎬᏩᎾᏣᏪᏐᎸᏍᏙᏗ ᎢᏳᎵᏍᏙᏗᏱ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ; ᎠᎴ ᏚᏂᎸᏫᏍᏓᏁᎸ ᏓᏳᏂᏍᏓᏩᏕᏏ.

source: And I saw a white cloud, and on the cloud I saw one seated, like a son of man, having on his head a crown of gold, and in his hand a sharp curved blade.
chr: ᎠᎴ ᏫᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎤᏁᎬ ᎤᎶᎩᎸᎩ, ᎠᎴ ᎤᎶᎩᎸ ᎩᎶ ᎤᏬᎸᎩ ᏴᏫ ᎤᏪᏥ ᎾᏍᎩᏯᎢ, ᎤᎵᏍᏚᎸᎩ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎠᎵᏍᏚᎶ, ᎠᎴ ᎪᏍᏓᏯ ᎠᏍᎫᏕᏍᏗ ᎦᏁᎲᎩ.

source: And another angel came out from the house of God, crying with a loud voice to him who was seated on the cloud, Put in your blade, and let the grain be cut: because the hour for cutting it is come; for the grain of the earth is over-ready.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎢᏳᏄᎪᏨᎩ ᎠᏍᏓᏯ ᎤᏪᎷᎬᎩ ᎯᎠ ᏂᎦᏪᏎᎲᎩ ᎤᎶᎩᎸ ᎤᏬᎵ, ᎠᏍᎫᏕᏍᏗ ᎲᏓ ᎠᎴ ᎯᏍᎫᏛᎦ; ᏣᏍᎫᏕᏍᏗᏱᏰᏃ ᎨᏒ ᎿᏉ ᎠᏍᏆᎸᎯᎦ; ᎡᎶᎯᏰᏃ ᎠᏍᎫᏕᏍᏗᏱ ᎨᏒ ᎤᎦᏛᎾᏨ.

source: And he who was seated on the cloud sent in his blade on the earth; and the grain of the earth was cut.
chr: ᎤᎶᎩᎸᏃ ᎤᏬᎵ ᎠᏍᎫᏕᏍᏗ ᎤᏤᎵ ᎤᏮᏔᏅᎩ; ᎠᎴ ᎡᎶᎯ ᎤᏍᎫᏕᏐᏅᎩ.

source: And another angel came out from the house of God which is in heaven, having a sharp curved blade.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᎯᏙᎯ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎦᎸᎳᏗ ᏨᏗᏓᏁᎸ ᏓᏳᏄᎪᏨᎩ, ᎾᏍᎩ ᎾᏍᏉ ᎦᏁᎲᎩ ᎪᏍᏓᏯ ᎠᏍᎫᏕᏍᏗ.

source: And another angel came out from the altar, who has power over fire; and he gave a loud cry to him who had the sharp curved blade, saying, Put in your sharp blade, and let the grapes of the vine of the earth be cut; for her grapes are fully ready.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎠᏥᎸᎨᎳᏍᏗᏱ ᎾᎥ ᏓᏳᏄᎪᏨᎩ, ᎾᏍᎩ ᎤᎲᎩ ᎠᏓᏅᏖᏍᎬᏉ ᎢᏳᏩᏗᏱ ᎠᏥᎸ; ᎠᎴ ᎠᏍᏓᏯ ᎤᎵᏍᏓᏁᎸᎩ ᎪᏍᏓᏯ ᎠᏍᎫᏕᏍᏗ ᎦᏁᎯ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎠᏍᎫᏕᏍᏗ ᏣᏤᎵ ᎪᏍᏓᏯ ᎲᏓ, ᎠᎴ ᎯᏟᏌ ᏖᎸᎳᏗ ᎡᎶᎯ ᎤᏛᏒᎯ; ᏖᎸᎳᏗᏰᏃ ᎿᏉ ᎤᏅᎾᏏᏌᏛ.

source: And the angel sent his blade into the earth, and the vine of the earth was cut, and he put it into the great wine-crusher of the wrath of God.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎠᏍᎫᏕᏍᏗ ᎤᏤᎵ ᎤᏪᏂᏙᎸᎩ ᎡᎶᎯ, ᎠᎴ ᎤᏪᏟᏌᏅᎩ ᏖᎸᎳᏗ ᎡᎶᎯ ᎤᏛᏒᎯ, ᎠᎴ ᏭᏓᎢᏅᏒᎩ ᏭᎸᏅᎩ ᎤᏔᏅ ᏖᎸᎳᏗ-ᎦᏨᏩᏍᏙᏗᏱ ᎤᏁᎳᏅᎯ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏤᎵᎦ.

source: And the grapes were crushed under foot outside the town, and blood came out from them, even to the head-bands of the horses, two hundred miles.
chr: ᏖᎸᎳᏗ-ᎦᏨᏩᏍᏙᏗᏱ ᎦᏚᎲ ᏙᏱᏗᏢ ᎤᎾᎳᏍᏓᎡᎸᎩ, ᎩᎬᏃ ᏓᏳᏨᏨᎩ ᏖᎸᎳᏗ-ᎦᏨᏩᏍᏙᏗᏱ, ᎠᎴ ᏐᏈᎵ ᏚᎾᏔᎾᎸ ᎢᏴᏛ ᏂᏚᏂᎶᏨᎩ, ᎾᏍᎩ ᏔᎵᏧᏈ ᎢᏳᏟᎶᏛ ᎢᎬᎾᏕᏅ.

source: And I saw another sign in heaven, great and strange; seven angels having the seven last punishments, for in them the wrath of God is complete.
chr: ᏅᏩᏓᎴᏃ ᎤᏰᎸᏛ ᎦᎸᎳᏗ ᎠᎩᎪᎲᎩ, ᎦᎸᏉᏗ ᎠᎴ ᎤᏍᏆᏂᎪᏗ, ᎾᏍᎩ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏓᏂᏰᎲᎩ ᎦᎵᏉᎩ ᎢᏳᏓᎴᎩ ᎤᎵᏍᏆᎸᏗ ᎤᏕᏔᏙᏗ; ᎾᏍᎩᏰᏃ ᎤᏁᎳᏅᎯ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎠᏂᎧᎵᏏᏏᎭ.

source: And I saw a sea which seemed like glass mixed with fire; and those who had overcome the beast and his image and the number of his name, were in their places by the sea of glass, with God's instruments of music in their hands.
chr: ᎠᎴ ᎠᎩᎪᎲᎩ ᎥᏓᎸ ᎠᏓᎨᏗ ᏗᎬᏩᎸᏌᏛ ᎾᏍᎩᏯᎢ ᎠᏥᎸ ᎤᏓᏑᏱ ᎨᏒᎩ; ᎠᎴ ᎾᏍᎩ Ꮎ [ᎥᎦᏥᎪᎥᎩ] ᏅᎩᏗᎦᏅᏌᏗ ᎤᎾᏓᎵᏁᎯᏕᎸᎯ, ᎠᎴ ᎾᏍᎩ Ꮎ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎠᎴ ᎤᏤᎵ ᏧᏬᏪᎶᏙᏗ, ᎠᎴ ᎾᏍᎩ ᏚᏙᎥ ᎢᎦᎢ ᎠᏎᏍᏗ ᎨᏒᎢ, ᎠᏂᏙᎾᎥᎩ ᎥᏓᎸ ᎠᏓᎨᏗ ᏗᎬᏩᎸᏌᏛ ᎾᏍᎩᏯᎢ, ᎤᏁᎳᏅᎯ ᏧᏤᎵ ᏗᎧᏃᎩᏍᏙᏗ ᏓᏂᏁᎲᎩ

source: And they give the song of Moses, the servant of God, and the song of the Lamb, saying, Great and full of wonder are your works, O Lord God, Ruler of all; true and full of righteousness are your ways, eternal King.
chr: ᎠᎴ ᏚᏂᏃᎩᏒᎩ ᎼᏏ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᏅᏏᏓᏍᏗ ᏧᏃᎩᏛ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᏤᎵ ᏗᎧᏃᎩᏍᏗ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎦᎸᏉᏗᏳ ᎠᎴ ᎤᏍᏆᏂᎪᏗᏳ ᏗᏣᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏣᎬᏫᏳᎯ ᎠᎴ ᏣᏁᎳᏅᎯ ᏫᎾᏍᏛᎾ ᏣᎵᏂᎩᏛ; ᎣᏍᏛ ᎠᎴ ᏚᏳᎪᏛ ᎢᎭᏛᏁᎵᏙᎯ ᏂᎯ ᏣᎬᏫᏳᎯ ᎤᎾᏓᏅᏘ ᎤᎾᏤᎵᎦ.

source: What man is there who will not have fear before you, O Lord, and give glory to your name? because you only are holy; for all the nations will come and give worship before you; for your righteousness has been made clear.
chr: ᎦᎪ ᏂᏣᎾᏰᏍᎬᎾ ᎨᏎᏍᏗ ᏂᎯ ᏣᎬᏫᏳᎯ, ᎠᎴ ᏂᎦᎸᏉᏗᏍᎬᎾ ᎨᏎᏍᏗ ᏕᏣᏙᎥᎢ? ᏂᎯᏰᏃ ᏨᏒᎯᏳ ᏂᏍᎦᏅᎾ, ᏂᎦᏗᏳᏰᏃ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒ ᏛᏂᎷᏥ ᎠᎴ ᏂᏣᏛᏅ ᎢᎬᏱᏢ ᏛᎾᏓᏙᎵᏍᏔᏂ; ᏂᎯᏰᏃ ᏗᏧᎪᏙᏗ ᎨᏒ ᎬᏂᎨᏒ ᏄᎵᏍᏔᏅ.

source: And after these things I saw, and the house of the Tent of witness in heaven was open:
chr: ᎣᏂᏃ ᎢᏴᏛ ᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᏗᎦᎳᏫᎢᏍᏗᏱ ᏗᎧᎿᏩᏛᏍᏗ ᏗᏗᏱ ᎦᎵᏦᏛ ᎤᎵᏍᏚᎢᏛ ᎨᏒᎩ ᎦᎸᎳᏗ;

source: And the seven angels who had the seven punishments came out from the house of God, clothed with linen, clean and bright and with bands of gold about their breasts.
chr: ᎦᎵᏉᎩᏃ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏗᎦᎳᏫᎢᏍᏗᏱ ᏓᏳᏂᏄᎪᏨᎩ, ᏓᏂᏰᎲᎩ ᎦᎵᏉᎩ ᎤᏕᏯᏙᏗ, ᏚᎾᏄᏮᎩ ᏂᏚᏓᏅᎦᎸᎾ ᎠᎴ ᏧᏁᎬ ᏙᎴᏛ ᏗᏄᏬ, ᎠᎴ ᏗᏂᏁᏥᏱ ᏚᎾᏓᏠᎲᎩ ᎠᏕᎸ-ᏓᎶᏂᎨ ᏗᎪᏢᏅᎯ ᏗᏓᏠᏍᏗ.

source: And one of the four beasts gave to the seven angels seven gold vessels full of the wrath of God, who is living for ever and ever.
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᎨᏒ ᏗᏅᏃᏛ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏚᏁᎸᎩ ᎦᎵᏉᎩ ᎫᎫ ᎠᏕᎸᏓᎶᏂᎨ ᏗᎪᏢᏔᏅᎯ, ᏗᎧᎵᎢ ᎤᏁᎳᏅᎯ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒᎢ, ᎾᏍᎩ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸ ᏤᎭ.

source: And the house of God was full of smoke from the glory of God, and from his power, and no one was able to go into the house of God, till the seven punishments of the seven angels were ended.
chr: ᏗᎦᎳᏫᎢᏍᏗᏱᏃ ᎤᎧᎵᏨᎩ ᏧᎧᎵᏨᎩ ᏧᎦᏒᏍᏗ ᎤᏁᎳᏅᎯ ᎠᏥᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ; ᎥᏝ ᎠᎴ ᎩᎶ ᏫᎬᏩᏴᏍᏗ ᏱᎨᏎ ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎬᏂ ᎾᏍᎩ Ꮎ ᎦᎵᏉᎩ ᏧᏕᏯᏙᏗ ᎨᏒ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏥᏚᎾᏒᎦᎸ ᏱᏚᎵᏍᏆᏛ.

source: And a great voice out of the house of God came to my ears, saying to the seven angels, Go, and let that which is in the seven vessels of the wrath of God come down on the earth.
chr: ᎠᏆᏛᎦᏅᎩᏃ ᎩᎶ ᎠᏍᏓᏯ ᏓᎧᏁᎬᎩ ᏗᎦᎳᏫᎢᏍᏗᏱ ᏛᏓᎴᎲᏍᎩ ᎯᎠ ᏂᏕᎦᏪᏎᎲᎩ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎢᏤᎾ, ᎠᎴ ᎡᎶᎯ ᏫᏂᏐᏅᏯ ᎤᏁᎳᏅᎯ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎫᎫ ᏓᏟᏍᏛᎢ.

source: And the first went, and let what was in his vessel come down on the earth; and it became an evil poisoning wound on the men who had the mark of the beast, and who gave worship to his image.
chr: ᎢᎬᏱᏱᏃ ᎨᏒ ᎤᏪᏅᏒᎩ, ᎠᎴ ᎦᏙᎯ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎤᏕᏯᏙᏗᏃ ᎠᎴ ᎡᎯᏍᏗ ᏚᏂᏣᏍᏓᎳᏛᎩ ᏴᏫ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᏤᎵ ᏗᎨᎪᏪᎶᏔᏅᎯ, ᎠᎴ ᎾᏍᎩ ᏣᎦᏟᎶᏍᏔᏅᎯ ᎠᎾᏓᏙᎵᏍᏓᏁᎯ.

source: And the second let what was in his vessel come out into the sea; and it became blood as of a dead man; and every living thing in the sea came to an end.
chr: ᏔᎵᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎠᎺᏉᎯ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎤᏲᎱᏒᎯᏃ ᏴᏫ ᎤᎩᎬ ᎾᏍᎩᏯ ᏄᎵᏍᏔᏅᎩ; ᎠᎴ ᏂᎦᏗᏳ ᏗᏅᏃᏛ ᎨᏒ ᎠᎺᏉᎯ ᎠᏁᎲ ᏚᏂᎵᏬᏨᎩ.

source: And the third let what was in his vessel come out into the rivers and the fountains of water; and they became blood.
chr: ᏦᎢᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎡᏉᏂ ᏕᎨᏴ ᎠᎴ ᎠᎹ ᏕᎦᏄᎪᎬ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎩᎬᏃ ᏂᏚᎵᏍᏔᏅᎩ.

source: And the voice of the angel of the waters came to my ears, saying, True and upright is your judging, O Holy One, who is and was from all time:
chr: ᎠᎴ ᎠᎹᏱ ᏗᎦᏘᏯ ᏗᎧᎿᏩᏗᏙᎯ ᎥᏥᏯᏛᎦᏁᎸᎩ, ᎯᎠ ᏄᏪᏒᎩ, ᏂᏍᎦᎤᎾ ᏣᎬᏫᏳᎯ, ᏂᎯ ᎾᏍᎩ ᏤᎭ, ᎠᎴ ᏤᎲᎩ, ᎠᎴ ᏤᎮᏍᏗ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᏄᏍᏛ ᏕᏧᎪᏔᏅᎢ.

source: For they made the blood of saints and prophets come out like a stream, and blood have you given them for drink; which is their right reward.
chr: ᎤᎾᏓᏅᏘᏰᏃ ᎠᎴ ᎠᎾᏙᎴᎰᏍᎩ ᎤᏂᎩᎬ ᎤᏂᏨᏅ, ᎠᎴ ᎩᎬ ᏕᎯᏁᏁᎸ ᎤᎾᏘᏔᏍᏗ; ᏰᎵᎦᏯᏰᏃ ᏚᏳᎪᏗ ᎾᏍᎩ ᎢᏳᎾᎵᏍᏓᏁᏗᏱ.

source: And a voice came from the altar, saying, Even so, O Lord God, Ruler of all, true and full of righteousness is your judging.
chr: ᏅᏩᏓᎴᏃ [ᏗᎧᎿᏩᏗᏙᎯ] ᎥᏥᏯᏛᎦᏁᎸᎩ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎯᎠ ᏅᏓᏳᏪᏒᎩ, ᎾᏍᎩᏯ ᏄᏍᏕᏍᏗ, ᏣᎬᏫᏳᎯ ᏣᏁᎳᏅᎯ ᏫᎾᏍᏛᎾ ᏣᎵᏂᎩᏛ, ᎣᏏᏳ ᎠᎴ ᏚᏳᎪᏛ ᏂᎯ ᏗᎫᎪᏙᏗ ᎨᏒᎢ.

source: And the fourth let what was in his vessel come out on the sun; and power was given to it that men might be burned with fire.
chr: ᏅᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᏅᏙ ᎢᎦ-ᎡᎯ ᎧᎸ ᎤᏪᏐᏴᏅᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎠᎴ ᎠᎦᎵᏍᎪᎸᏓᏁᎸᎩ ᎠᏥᎸ ᎬᏗ ᏧᎴᏴᏙᏗᏱ ᏴᏫ.

source: And men were burned with great heat: and they said evil things against the name of the God who has authority over these punishments; and they were not turned from their evil ways to give him glory.
chr: ᎠᎴ ᎤᏣᏘ ᎤᏗᎴᎩ ᎨᏒ ᏕᎨᏥᎴᏴᏙᏔᏅᎩ ᏴᏫ, ᎠᎴ ᎤᏁᎳᏅᎯ ᏚᏙᎥ ᎤᏂᏐᏢᎢᏍᏔᏅᎩ, ᎾᏍᎩ ᎠᏓᏅᏖᏍᎬᏉ ᎢᎬᏩᏁᎵᏓᏍᏗ ᏥᎩ ᎯᎠ ᎾᏍᎩ ᎤᏕᏯᏙᏗ ᎨᏒᎢ; ᎠᎴ ᎥᏝ ᏱᏚᏂᏁᏟᏴᏎ ᏚᎾᏓᏅᏛ ᎾᏍᎩ ᎬᏩᎸᏉᏙᏗᏱ.

source: And the fifth let what was in his vessel come out on the high seat of the beast; and his kingdom was made dark; and they were biting their tongues for pain.
chr: ᎯᏍᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᏪᏗᏱ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ, ᎤᏥᎵᎪᎯᏃ ᎨᏒ ᎤᎧᎵᏦᏅᎩ ᎤᎵᏏᎩ; ᏓᏂᏃᏓᏛᏃ ᏚᏂᎩᏍᏙᎥᎩ ᏚᏁᎯᏍᏓᏁᎲ ᎢᏳᏍᏗ,

source: And they said evil things against the God of heaven because of their pain and their wounds; and they were not turned from their evil works.
chr: ᎠᎴ ᎤᏁᎳᏅᎯ ᎦᎸᎳᏗ ᎡᎯ ᎤᏂᏐᏢᎢᏍᏔᏅᎩ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᏚᏁᎯᏍᏓᏁᎲᎢ ᎠᎴ ᏚᏂᏥᏍᏓᎸᎢ, ᎠᎴ ᎥᏝ ᎤᏲ ᏳᏂᏰᎸᏁ ᏄᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ.

source: And the sixth let what was in his vessel come out on the great river Euphrates; and it became dry, so that the way might be made ready for the kings from the east.
chr: ᏑᏓᎵᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎡᏆ ᎡᏉᏂ ᎤᏪᏴ ᏳᏇᏗ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎠᎹᏃ ᎾᎿ ᎡᎬ ᎤᎶᏐᏅᎩ, ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᏗᎧᎸᎬ ᎢᏗᏢ ᎠᏁᎯ ᎤᏂᏅᏅ ᎨᎦᏛᏅᎢᏍᏓᏁᏗᏱ ᎠᏰᎸᏒᎩ.

source: And I saw coming out of the mouth of the dragon, and out of the mouth of the beast, and out of the mouth of the false prophet, three unclean spirits, like frogs.
chr: ᎠᎴ ᏦᎢ ᎢᏯᏂᏛ ᎠᏂᎦᏓᎭ ᏗᏓᏅᏙ ᎦᏥᎪᎥᎩ ᏩᎶᏏ ᏗᎾᏤᎵᏛ, ᎢᎾᏛ ᎠᎰᎵ ᏓᏳᏂᏄᎪᏨᎩ, ᎠᎴ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎠᎰᎵ, ᎠᎴ ᎤᏠᎾᏍᏗ ᎠᏙᎴᎰᏍᎩ ᎠᎰᎵ.

source: For they are evil spirits, working signs; who go out even to the kings of all the earth, to get them together to the war of the great day of God, the Ruler of all.
chr: ᎠᏂᏍᎩᎾᏰᏃ ᏧᎾᏓᏅᏙ ᎾᏍᎩ, ᎤᏍᏆᏂᎪᏗ ᏚᏂᎸᏫᏍᏓᏁᎭ, ᎡᎶᎯ ᎠᏁᎯ ᎤᏂᎬᏫᏳᎯ ᎠᎴ ᎡᎳᏂᎬ ᏓᏂᏩᏛᎮᎦ, ᎾᏍᎩ ᏧᏂᏟᏐᏗᏱ ᏧᎾᎵᏍᏗᏱ ᎤᏂᏰᎸᎭ ᎦᎸᏉᏗ ᎢᎦ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ ᏥᎩ.

source: (See, I come as a thief. Happy is he who is watching and keeps his robes, so that he may not go unclothed, and his shame be seen.)
chr: ᎬᏂᏳᏉ, ᎦᏃᏍᎩᏍᎩ ᏥᎦᎷᎪ ᎾᏍᎩᏯ ᏓᏥᎷᏥ. ᎣᏏᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎾᏍᎩ Ꮎ ᎠᏯᏫᏍᎩ, ᎠᎴ ᏧᏄᏬ ᏗᏍᏆᏂᎪᏗᏍᎩ, ᎾᏍᎩ ᎤᏰᎸᎭ ᎤᏪᏓᏍᏗᏱ ᏂᎨᏒᎾ, ᎠᎴ ᎤᏕᎰᎯᏍᏗ ᎨᏒ ᎠᏥᎪᏩᏛᎡᏗᏱ ᏂᎨᏒᎾ.

source: And they got them together into the place which is named in Hebrew Armageddon.
chr: ᎠᎴ ᏚᏪᏟᏌᏅᎩ ᎠᎹᎨᏙᏂ ᏚᏙᎥ ᎠᏂᏈᎷ ᎤᏂᏬᏂᎯᏍᏗ ᎨᏒ ᏯᎬᏗᎭ.

source: And the seventh let what was in his vessel come out on the air; and there came out a great voice from the house of God, from the high seat, saying, It is done.
chr: ᎦᎵᏉᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎦᎳᏅᏛᏉ ᎦᎸᎶᎢ ᎤᏪᏐᏅᏴᎩ ᎫᎫ ᎠᏰᎲ ᎠᏟᏍᏛᎢ; ᎠᎴ ᎠᏍᏓᏯ ᏗᎧᏁᎬ ᎩᎶ ᎦᎸᎳᏗ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᎴ ᎾᎿ ᏗᎦᏍᎩᎸ ᏓᏳᏓᎴᏅᎩ, ᎯᎠ ᏅᏓᎦᏪᏍᎬᎩ, ᎿᏉ ᎠᎵᏍᏆᏓ.

source: And there were flames and voices and thunders; and there was a great earth-shock so that never, from the time when men were on the earth, had there been so great an earth-shock, so full of power.
chr: ᎿᏉᏃ ᏚᏍᏆᏃᏴᎳᏒᎩ, ᎠᎴ ᏚᏴᏓᏉᎶᎥᎩ, ᎠᎴ ᏚᎾᎦᎸᎲᎩ; ᎠᎴ ᎦᏙᎯ ᎤᏣᏘ ᎤᎵᏖᎸᏅᎩ, ᎾᏍᎩ ᎢᎦᎢ ᎥᏝ ᎢᎸᎯᏳ ᏱᎬᏩᎵᏖᎸᏃ ᏴᏫ ᎡᎶᎯ ᎤᎾᏕᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ, ᎾᏍᎩ ᎢᏳᎵᏂᎩᏛ ᎠᎴ ᎾᏍᎩ ᎢᏳᏍᎦᏎᏗ.

source: And the great town was cut into three parts, and the towns of the nations came to destruction: and Babylon the great came into mind before God, to be given the cup of the wine of his wrath.
chr: ᎠᎴ ᎾᏍᎩ ᎡᏆ ᎦᏚᎲ ᏦᎢ ᏄᏓᏛᎩ, ᎠᎴ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒ ᏚᏂᏚᎲ ᏚᏲᏨᎩ; ᎠᎴ ᏓᏓᎶᏂ ᎦᎸᏉᏗ ᎦᏚᎲ ᎠᏅᏓᏗᏍᏗ ᏄᎵᏍᏔᏅᎩ ᎤᏁᎳᏅᎯ ᏄᏛᏅᎢ, ᎾᏍᎩ ᎠᏥᏁᏗᏱ [ᏓᏓᎶᏂ] ᎤᎵᏍᏈᏗ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎠᏟᏍᏛ ᎤᏣᏘ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏩᏛᏗ.

source: And every island went in flight, and the mountains were seen no longer.
chr: ᎠᎴ ᏂᎦᏛ ᎠᎹᏰᎵ ᏚᏪᎧᏩᏗᏒ ᎤᎾᎵᏒᎩ, ᎠᎴ ᏙᏓᎸ ᎥᏝ ᏗᎬᏩᏛᏗ ᏱᎨᏎᎢ.

source: And great drops of ice, every one about the weight of a talent, came down out of heaven on men: and men said evil things against God because of the punishment of the ice-drops; for it is very great.
chr: ᎡᏆᏃ ᎤᏁᏐᎠᏒᎩ ᏴᏫ ᎠᏁᎲ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ, ᏌᏉᎭ ᎨᏒ ᏔᎸᏗ ᏄᏓᎨᏒ ᏄᏓᎨᏒᎩ; ᏴᏫᏃ ᎤᏁᎳᏅᎯ ᎤᏂᏐᏢᎢᏍᏔᏅᎩ ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎤᏁᏍᏓᎳ ᎤᎾᏕᏯᏙᏗᏍᎬᎢ; ᎤᏣᏘᏰᏃ ᎤᎾᏕᏯᏙᏗᏍᎬᎩ ᎾᏍᎩ.

source: And one of the seven angels who had the seven vessels came and said to me, Come here, so that you may see the judging of the evil woman who is seated on the great waters;
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ Ꮎ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᎨᏒ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎾᏍᎩ ᎦᎵᏉᎩ ᎫᎫ ᏥᏓᏂᏰᎲᎩ, ᎤᎷᏨᎩ ᎠᎴ ᎠᏆᎵᏃᎮᏔᏅᎩ, ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᎡᎮᎾ; ᏓᎬᎾᏄᎪᏫᏎᎵ ᏄᏍᏛ ᏣᎫᎪᏓᏁᏗ ᎨᏒ ᎤᏣᏘ ᎤᏁᎫᏥᏛ ᎠᎨᏴ, ᎤᏣᏘ ᎠᎹ ᏚᏪᏴ ᏧᏬᎳ;

source: With whom the kings of the earth made themselves unclean, and those who are on the earth were full of the wine of her evil desires.
chr: ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎯ ᎤᏕᎵᏛ ᏧᎾᏂᏏᏅᎯ ᏥᎩ, ᎠᎴ ᎡᎶᎯ ᏓᏁᏩᏗᏒ ᏧᏂᏴᏍᏕᏍᏔᏅᎯ ᏥᎩ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎤᏕᎵᏛ ᏚᏂᏏᏂᏙᎸ ᎤᏩᏛᏛ.

source: And he took me away in the Spirit into a waste land: and I saw a woman seated on a bright red beast, full of evil names, having seven heads and ten horns,
chr: ᎾᏍᎩᏃ ᎠᏓᏅᏙ ᎬᏗ ᎢᎾᎨ ᏩᏆᏘᏅᏍᏔᏅᎩ; ᎠᎨᏴᏃ ᎥᏥᎪᎲᎩ ᎩᎦᎨ ᏗᎧᏃᏗᏱ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᎩᎸᏛᎩ ᎾᏍᎩ ᎤᎧᎵᏨᎯ ᎨᏒᎩ ᎤᏁᎳᏅᎯ ᏚᏙᎥ ᎠᏐᏢᎢᏍᏙᏗ ᎨᏒᎢ ᎦᎵᏉᎩ ᏓᏍᎫᏓᏛᎩ, ᎠᎴ ᎠᏍᎪᎯ ᏕᎤᎷᎬᎩ.

source: And the woman was clothed in purple and bright red, with ornaments of gold and stones of great price and jewels; and in her hand was a gold cup full of evil things and her unclean desires;
chr: ᎠᎨᏴᏃ ᏗᏕᎭᎷᎨ ᎠᎴ ᏗᎩᎦᎨ ᏚᏄᏩᎥᎩ, ᎠᎴ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎠᎴ ᏗᎦᎸᏉᏗ, ᏅᏯ ᎠᎴ ᏓᎬᎾ-ᎢᏳᎾᏍᏗ ᏚᏣᏅᏛᎩ, ᎠᎴ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎠᏢᎳᏅᎯ ᎤᎵᏍᏈᏗ ᎠᏰᎲᎩ ᎠᎧᎵᎢ ᎤᏂᏆᏘᏍᏗ ᎨᏒ, ᎠᎴ ᎤᏁᎢᎸᏗ ᎾᏍᎩ ᎤᏕᎵᏛ ᏚᏂᏏᏂᏙᎸ ᎤᏩᏛᏛ.

source: And on her brow was a name, SECRET, BABYLON THE GREAT, THE MOTHER OF THE EVIL WOMEN AND OF THE UNCLEAN THINGS OF THE EARTH.
chr: ᎠᎬᏓᎨᏂᏃ ᏚᏙᎥ ᎪᏪᎸᎩ, [ᎯᎠ ᏂᎬᏅᎩ] ᎤᏕᎵᏛ ᎨᏒᎢ, ᏓᏓᎶᏂ ᎡᏆ, ᎤᏂᏁᎫᏥᏛ ᎠᏂᎨᏴ ᎤᏂᏥ ᎠᎴ ᎤᏂᏆᏘᏍᏗ ᎡᎶᎯ ᎡᎯ.

source: And I saw the woman overcome as with the wine of the blood of the saints, and the blood of those put to death because of Jesus. And when I saw her, I was overcome with a great wonder.
chr: ᎠᎴ ᎠᎨᏴ ᎥᏥᎪᎥᎩ ᎤᎾᏓᏅᏘ ᎤᏂᎩᎬ, ᎠᎴ ᏥᏌ ᎬᏩᏃᎮᏍᎩ ᎤᏂᎩᎬ ᎤᏴᏍᏕᏍᏗᏍᎬᎩ; ᏥᎪᎥᏃ ᎤᏣᏘ ᎠᏍᏆᏂᎪᎯᏍᏗ ᎨᏒ ᎬᏗ ᎠᎩᏍᏆᏂᎪᏒᎩ.

source: And the angel said to me, Why were you surprised? I will make clear to you the secret of the woman, and of the beast on which she is seated, which has the seven heads and the ten horns.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᎦᏙᏃ ᎥᏣᏍᏆᏂᎪᎵ? ᏓᎬᏃᏁᎵ ᏄᏍᏛ ᎦᏛᎬ ᎠᎨᏴ, ᎠᎴ ᏄᏍᏛ ᎦᏛᎬ ᏅᎩᏗᎦᏅᏌᏗ ᎾᏍᎩ ᏧᎩᎸᏗ, ᎾᏍᎩ ᎦᎵᏉᎩ ᏥᏓᏍᎫᏓᏛ ᎠᎴ ᎠᏍᎪᎯ ᏥᏚᎷᎦ.

source: The beast which you saw was, and is not; and is about to come up out of the great deep, and to go into destruction. And those who are on the earth, whose names have not been put in the book of life from the first, will be full of wonder when they see the beast, that he was, and is not, and still will be.
chr: ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏥᎪᎥᎩ, ᎡᎲᎩ, ᎠᎴ ᎥᏝ ᏰᎭ; ᎠᎴ ᏙᏛᎴᏂ ᏫᎾᏍᏛᎾ ᏗᏔᎴᏒ ᏓᎦᏄᎪᏥ, ᎠᎴ ᎠᏥᏛᏙᏗᏱ ᏮᏓᎦᎶᏏ, ᎾᏍᎩᏃ Ꮎ ᎡᎶᎯ ᎠᏁᎯ ᎾᏍᎩ ᏚᎾᏙᎥ ᏂᏗᎪᏪᎳᏅ Ꮎ ᎬᏂᏛ ᎪᏪᎵᎯ ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᎴᏅᏛ ᏛᏂᏍᏆᏂᎪᏏ ᎠᏂᎪᎲᎭ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎾᏍᎩ ᏤᎲᎩ, ᎠᎴ ᏁᎲᎾ ᏥᎩ, ᎠᏎᏃ ᎾᏍᎩ ᏤᎭ.

source: Here is the mind which has wisdom. The seven heads are seven mountains, on which the woman is seated:
chr: ᎠᏂ ᎠᎦᏙᎲᎯᏍᏗ ᎨᏒ ᎠᏓᏅᏙ ᎬᏙᏗ ᎪᎵᏍᏗ. ᎾᏍᎩ Ꮎ ᎦᎵᏉᎩ ᏓᏍᎫᏓᏛ ᎦᎵᏉᎩ ᏙᏓᎸ ᎦᏛᎦ, ᎾᎿ ᎠᎨᏴ ᏧᏬᎳ.

source: And they are seven kings; the five have come to an end, the one is, the other has not come; and when he comes, he will have to go on for a little time.
chr: ᎠᎴ ᎦᎵᏉᎩ ᎾᏂᎥ ᎤᏂᎬᏫᏳᎯ; ᎯᏍᎩ ᎢᏯᏂᏛ ᎤᎾᎵᏛᏔᏅ, ᎠᎴ ᎠᏏᏴᏫ ᎡᎭ, ᏐᎢᏃ ᎥᏝ ᎠᏏ ᏱᎦᎾᏄᎪᎦ; ᎠᎴ ᎦᎷᏨᎭ ᏝᎦ ᎤᏕᏗ ᎨᏎᏍᏗ.

source: And the beast which was, and is not, is himself the eighth, and is of the seven; and he goes into destruction.
chr: ᎾᏍᎩᏃ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏤᎲᎩ, ᎠᎴ ᎾᏍᎩ ᏁᎲᎾ ᏥᎩ, ᎾᏍᎩ ᏧᏁᎵᏁᎢ, ᎠᎴ ᎾᏍᎩ ᏚᎵᏉᎩ ᎢᏯᏂᏛ ᎨᏒ ᎨᎳ, ᎠᎴ ᎠᏥᏛᏙᏗᏱ ᏮᏓᎦᎶᏏ.

source: And the ten horns which you saw are ten kings, which still have been given no kingdom; but they are given authority as kings, with the beast, for one hour.
chr: ᎠᏍᎪᎯᏃ ᏕᎤᎷᎬ ᏥᏕᏣᎪᎲᎩ, ᎾᏍᎩ ᎠᏍᎪᎯ ᎤᏂᎬᏫᏳᎯ ᎦᏛᎦ, ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᎢᏳᎾᎵᏍᏙᏗᏱ ᎨᏒ ᎠᏏ ᎨᏥᏁᎸᎯ ᏂᎨᏒᎾ ᎨᏒᎢ; ᎨᎦᎵᏍᎪᎸᏓᏁᎭᏍᎩᏂᏃᏅ ᎤᏂᎬᏫᏳᎯ ᎤᏂᏁᎢᏍᏗ ᎨᏒ ᎤᏂᏁᎢᏍᏗᏱ ᏌᏉ ᎢᏳᏟᎶᏛ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᏠᏱ ᎧᏁᎬᎢ.

source: These have one mind, and they give their power and authority to the beast.
chr: ᎯᎠ ᎾᏍᎩ ᏌᏉ ᏄᏅᏅ ᏚᎾᏓᏅᏛᎢ, ᎠᎴ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏄᏍᏛ ᎤᎾᏒᎦᎸ ᎠᎴ ᏚᎾᎵᏂᎬᎬ ᏙᏛᏂᏲᎯᏎᎵ.

source: These will make war against the Lamb, and the Lamb will overcome them, because he is the Lord of lords and King of kings; and those who are with him are named, marked out, and true.
chr: ᎯᎠ ᎾᏍᎩ ᏓᎿᏩ ᏅᏛᏅᏁᎵ ᎤᏃᏕᎾ ᎠᎩᎾ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᏙᏛᏎᎪᎩᏏ ᎾᏍᎩ; ᎾᏍᎩᏰᏃ ᎤᏂᎬᏫᏳᎯ ᎠᏁᎲ ᎤᎬᏫᏳᎯ; ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏁᎲ ᎾᏍᎩ ᏄᎬᏫᏳᏌᏕᎩ; ᎠᎴ ᎾᏍᎩ ᎬᏩᏜᏩᏍᏗᏕᎩ ᏥᎩ ᎨᏥᏯᏅᏛ, ᎠᎴ ᎨᎦᏑᏰᏛ, ᎠᎴ ᏄᎾᏓᎵᏓᏍᏛᎾ.

source: And he said to me, The waters which you saw, where the evil woman is seated, are peoples, and armies, and nations and languages.
chr: ᎠᎴ ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᎠᎹ ᏥᏕᏣᎪᎲᎩ, ᎾᎿ ᎤᏁᎫᏥᏛ ᎠᎨᏴ ᏧᏬᎳ, ᏴᏫ ᎦᏛᎦ, ᎠᎴ ᎤᏂᏣᏘ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏓᏤᎵᏗ ᏴᏫ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ.

source: And the ten horns which you saw, and the beast, these will be turned against the evil woman, and will make her waste and uncovered, and will take her flesh for food, and will have her burned with fire.
chr: ᎠᎴ ᎠᏍᎪᎯ ᏕᎤᎷᎬ ᏥᏕᏣᎪᎲᎩ, ᎾᏍᎩ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏚᎷᎬᎢ, ᎾᏍᎩ ᏓᎬᏩᏂᏆᏘᎵ ᎤᏁᎫᏥᏛ ᎠᎨᏴ, ᎠᎴ ᏅᏔ ᎠᎴ ᎤᏰᎸᎭ ᏅᏓᏰᎬᏁᎵ, ᎠᎴ ᎤᏇᏓᎸ ᏓᎬᏩᎨᎵ, ᎠᎴ ᎠᏥᎸ ᎬᏗ ᏓᎬᏩᎪᎲᏍᏔᏂ.

source: Because God has put it in their hearts to do his purpose, and to be of one mind, giving their kingdom to the beast, till the words of God have effect and are complete.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᏚᎳᏁᎸ ᎫᏂᎾᏫᏱ ᏄᏍᏛ ᎠᏓᏅᏖᏍᎬ ᎤᏂᏍᏆᏗᏍᏗᏱ, ᎠᎴ ᏌᏉ ᎢᏳᏅᏁᏗᏱ ᏚᎾᏓᏅᏛᎢ, ᎠᎴ ᏧᏂᏲᎯᏎᏗᏱ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎾᎿ ᎤᏂᎬᏫᏳᎯ ᎨᏒᎢ, ᎬᏂ ᎤᏁᎳᏅᎯ ᎤᏁᏨ ᎾᏍᎩ ᎢᏳᎵᏍᏔᏅᎯ ᎨᏎᏍᏗ.

source: And the woman whom you saw is the great town, which is ruling over the kings of the earth.
chr: ᎠᎨᏴᏃ Ꮎ ᏥᎪᏩᏘᏍᎬᎩ ᎾᏍᎩ Ꮎ ᎡᏆ ᎦᏚᎲ ᎦᏛᎦ, ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎲ ᎤᎬᏫᏳᏌᏕᎩ ᏥᎩ.

source: After these things I saw another angel coming down out of heaven, having great authority; and the earth was bright with his glory.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᎵᏍᏔᏂᏙᎸ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎥᏥᎪᎥᎩ ᎦᎸᎳᏗ ᏓᏳᏠᎠᏒᎩ, ᎤᏣᏘ ᎤᎵᏂᎩᏛ ᎨᏒᎩ; ᎾᏍᎩᏃ ᎤᏤᎵ ᎦᎸᏉᏗᏳ ᎨᏒ ᎡᎶᎯ ᎢᎦ ᎤᏘᏍᏔᏅᎩ.

source: And he gave a loud cry, saying, Babylon the great has come down from her high place, she has come to destruction and has become a place of evil spirits, and of every unclean spirit, and a hole for every unclean and hated bird.
chr: ᎠᎴ ᎠᏍᏓᏯ ᎤᏪᎷᏅᎩ ᎤᎵᏂᎩᏛ ᎧᏁᎬ ᎬᏗ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᏓᏓᎶᏂ ᎡᏆ ᎠᏲᎩ, ᎠᏲᎩ, ᎠᎴ ᎠᏂᏍᎩᎾ ᎤᎾᏕᏗᏱ ᏂᎦᎵᏍᏓ, ᎠᎴ ᎾᏂᎥ ᎠᏂᎦᏓᎭ ᏗᏓᏅᏙ ᎤᏂᏴᏍᏗᏱ, ᎠᎴ ᎾᏂᎥ ᎠᏂᎦᏓᎭ ᎠᎴ ᎤᏂᏂᏆᏘᏍᏗ ᏥᏍᏆ ᎤᎾᏁᎳᏗᏍᏗᏱ.

source: For through the wine of the wrath of her evil desires all the nations have come to destruction; and the kings of the earth made themselves unclean with her, and the traders of the earth had their wealth increased by the power of her evil ways.
chr: ᏂᎦᏗᏳᏰᏃ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒ ᎤᎾᏗᏔᎲ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏓᏑᏱ ᎾᏍᎩ ᎤᏕᎵᏛ ᏚᏂᏏᏂᏙᎸ ᎢᏳᏩᏂᏌᏛ, ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎯ ᎾᏍᎩ ᎤᏕᎵᏛ ᏚᎾᏂᏏᏂᏙᎸ, ᎠᎴ ᎠᏂᏃᏗᏍᎩ ᎡᎶᎯ ᎠᏁᎯ ᏚᏁᏅᎢᏍᏔᏅ ᎾᏍᎩ ᎤᏣᏘ ᎤᏢᏉᏗ ᎡᎲᎢ.
